--- a/docs/branches.md
+++ b/docs/branches.md
@@ -298,28 +298,32 @@ graph LR
 ```
 
 Delete 'cool-feature'
-```graphviz
-digraph {
-  rankdir=LR
-  "commit2" -> "commit1"
-  "commitX" -> "commit1"
-  "commit3" -> "commit2"
-  "commitY" -> "commitX"
-  "master" -> "commit4" [style=dashed]
-  "commit4" -> "commit3"
-  "commit4" -> "commitY"
-  master [shape=plaintext]
-}
+
+```mermaid
+graph LR
+
+  commitX(["commitX"])
+  commit1(["commit1"])
+  commit2(["commit2"])
+  commitY(["commitY"])
+  commit3(["commit3"])
+
+  commit2 --> commit1
+  commitX --> commit1
+  commit3 --> commit2
+  commitY --> commitX
+
+  master["master"]
+  master -.-> commit4 
+  commit4 --> commit3
+  commit4 --> commitY
 ```
+
 (Time goes leftwards)
 
